vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA266_DFP.pdsc
            // Set watch point
            Write32(0xE0001020, 0x00000000);
            Write32(0xE0001028, 0xF0000412);
            Write32(0xE0001030, 0x000FFFFF);
            Write32(0xE0001038, 0xF0000403);
            
            // De-assert nRESET line
            canReadPins = (DAP_SWJ_Pins(0x00, nReset, 0) != 0xFFFFFFFF);
          </block>
          <!-- Keep reset active for 50 ms -->
          <control while="1" timeout="50000"/>
          <control if="canReadPins">
            <!-- Assert nRESET line and wait max. 1s for recovery -->
            <control while="(DAP_SWJ_Pins(nReset, nReset, 0) &amp; nReset) == 0" timeout="1000000"/>
          </control>
          <control if="!canReadPins">
            <block>
              // Assert nRESET line
              DAP_SWJ_Pins(nReset, nReset, 0);
            </block>
            <!-- Wait 100ms for recovery if nRESET not readable -->
            <control while="1" timeout="100000"/>
          </control>
          <control if="(__connection &amp; (1 &lt;&lt; 17)) == 0">
            <block>
              Sequence("WaitForStopAfterReset");
              __errorcontrol = 0;
            </block>
          </control>
        </sequence>
        <sequence name="ResetSystem">
          <block>
            __dp = 0;
            __ap = 0;
            // System Control Space (SCS) offset as defined in Armv6-M/Armv7-M.
            __var SCS_Addr   = 0xE000E000;
            __var AIRCR_Addr = SCS_Addr + 0xD0C;
            __var DHCSR_Addr = SCS_Addr + 0xDF0;
            __var DEMCR_Addr = SCS_Addr + 0xDFC;
            __var tmp;
            //Halt the core
            Write32(DHCSR_Addr, 0xA05F0003);
            //clear VECTOR CATCH and set TRCENA
            tmp = Read32(DEMCR_Addr);
            Write32(DEMCR_Addr, tmp | 0x1000000);
            
            //// // Set watch point at SYSCON_BASE + 0x40 access
            //// Write32(0xE0001020, 0x4009123C);
            //// Write32(0xE0001028, 0x00000814);
            
            // Set watch point
            Write32(0xE0001020, 0x00000000);
            Write32(0xE0001028, 0xF0000412);
            Write32(0xE0001030, 0x000FFFFF);
            Write32(0xE0001038, 0xF0000403);
            
            __errorcontrol = 1;
            // Execute SYSRESETREQ via AIRCR
            Write32(AIRCR_Addr, 0x05FA0004);
            Sequence("WaitForStopAfterReset");
            __errorcontrol = 0;
          </block>
        </sequence>
        <sequence name="ResetProcessor" disable="1"/>
        <sequence name="TraceStart">
          <control if="__traceout &amp; 0x1" info="SWO Trace output selected">
            <block>Sequence("EnableTraceClk");       // Enable and configure trace clock</block>
            <control if="SWO_Pin == 0" info="SWO via PIO0_2">
              <block>Write32(0x400BC088, 0x00001140); // PIO0_2 PORT0_PCR2 mux to SWO</block>
            </control>
          </control>
        </sequence>
      </sequences>
      <debugvars configfile="devices/MCXA266/arm/MCXA.dbgconf">
        // Debug Access Variables, can be modified by user via copies of DBGCONF files as created by uVision. Also see sub-family level.
        __var SWO_Pin               = 0;                    // Serial Wire Output pin: 0 = P0_2
        __var Dbg_CR                = 0x00000000;           // DBG_CR
        __var BootTime              = 300000;               // 300 milliseconds
      </debugvars>
      <description>
        Arm® Cortex®-M33 microcontroller with multiple high-speed connectivity, operating up to 240MHz, serial peripherals, timers, analog and low power consumption.
      </description>
      <device Dname="MCXA266">
        <processor Dcore="Cortex-M33" Dfpu="SP_FPU" Dmpu="MPU" Dtz="NO_TZ" Ddsp="DSP" Dendian="Little-endian" Dclock="240000000"/>
        <environment name="iar">
          <file category="linkerfile" name="devices/MCXA266/iar/MCXA266_flash.icf"/>
        </environment>
        <memory name="BootROM" start="0x03000000" size="0x2000" access="rx"/>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x0fe000" access="rx" default="1" startup="1"/>
        <memory name="SRAM" start="0x20000000" size="0x03c000" access="rw" default="1"/>
        <memory name="SRAMX0" start="0x04000000" size="0x2000" access="rw" default="1"/>
        <memory name="SRAMX1" start="0x04002000" size="0x2000" access="rw" default="1"/>
        <algorithm name="devices/MCXA266/arm/MCXA_1024.FLM" start="0x00000000" size="0xFE000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
        <debug svd="devices/MCXA266/MCXA266.xml"/>
        <variant Dvariant="MCXA266VLQ">
          <compile header="devices/MCXA266/fsl_device_registers.h" define="CPU_MCXA266VLQ"/>
        </variant>
        <variant Dvariant="MCXA266VLL">
          <compile header="devices/MCXA266/fsl_device_registers.h" define="CPU_MCXA266VLL"/>
        </variant>
        <variant Dvariant="MCXA266VLH">
          <compile header="devices/MCXA266/fsl_device_registers.h" define="CPU_MCXA266VLH"/>
        </variant>
        <variant Dvariant="MCXA266VPN">
          <compile header="devices/MCXA266/fsl_device_registers.h" define="CPU_MCXA266VPN"/>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="device.MCXA266.internal_condition">
      <accept Dname="MCXA266VLH" Dvendor="NXP:11"/>
      <accept Dname="MCXA266VLL" Dvendor="NXP:11"/>
      <accept Dname="MCXA266VLQ" Dvendor="NXP:11"/>
      <accept Dname="MCXA266VPN" Dvendor="NXP:11"/>
    </condition>
    <condition id="cmake_toolchain.condition_id">
      <require condition="allOf.device=MCXA266.internal_condition"/>
    </condition>
    <condition id="allOf.device=MCXA266.internal_condition">
      <require condition="device.MCXA266.internal_condition"/>
    </condition>
    <condition id="component.at_least_one_i2c_mux_device_enabled.condition_id">
      <require condition="allOf.component.i2c_mux_pca954x, device=MCXA266.internal_condition"/>
    </condition>
