vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA266_DFP.pdsc
    <condition id="component.sgi_pkc.doc.mcxa.condition_id">
      <require condition="allOf.anyOf=device_id=MCXA266.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=device_id=MCXA266.internal_condition">
      <require condition="anyOf.device_id=MCXA266.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.ecc.condition_id">
      <require condition="allOf.component.sgi_pkc.buffer, component.sgi_pkc.flow_protection, component.sgi_pkc.mac, component.sgi_pkc.math, component.sgi_pkc.pkc, component.sgi_pkc.pre_processor, component.sgi_pkc.secure_counter, device=MCXA266.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.buffer, component.sgi_pkc.flow_protection, component.sgi_pkc.mac, component.sgi_pkc.math, component.sgi_pkc.pkc, component.sgi_pkc.pre_processor, component.sgi_pkc.secure_counter, device=MCXA266.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_buffer"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_flow_protection"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_mac"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_math"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_pkc"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_pre_processor"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_secure_counter"/>
      <require condition="device.MCXA266.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.example.condition_id">
      <require condition="allOf.component.sgi_pkc.random_modes, device=MCXA266.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.random_modes, device=MCXA266.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_random_modes"/>
      <require condition="device.MCXA266.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.examples.condition_id">
      <require condition="allOf.component.sgi_pkc.example, component.sgi_pkc.examples_aead, component.sgi_pkc.examples_cipher_modes, component.sgi_pkc.examples_crc, component.sgi_pkc.examples_ecc, component.sgi_pkc.examples_ffdh, component.sgi_pkc.examples_flow_protection, component.sgi_pkc.examples_glikey, component.sgi_pkc.examples_hash_modes, component.sgi_pkc.examples_hmac, component.sgi_pkc.examples_key, component.sgi_pkc.examples_mac_modes, component.sgi_pkc.examples_memory, component.sgi_pkc.examples_random, component.sgi_pkc.examples_random_modes, component.sgi_pkc.examples_rsa, device=MCXA266.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.example, component.sgi_pkc.examples_aead, component.sgi_pkc.examples_cipher_modes, component.sgi_pkc.examples_crc, component.sgi_pkc.examples_ecc, component.sgi_pkc.examples_ffdh, component.sgi_pkc.examples_flow_protection, component.sgi_pkc.examples_glikey, component.sgi_pkc.examples_hash_modes, component.sgi_pkc.examples_hmac, component.sgi_pkc.examples_key, component.sgi_pkc.examples_mac_modes, component.sgi_pkc.examples_memory, component.sgi_pkc.examples_random, component.sgi_pkc.examples_random_modes, component.sgi_pkc.examples_rsa, device=MCXA266.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_ecc_example"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_aead"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_cipher"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_crc"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_ecc"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_ffdh"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_flow_protection"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_glikey"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_hash_modes"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_hmac"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_key"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_mac_modes"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_memory"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_random"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_random_modes"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_rsa"/>
      <require condition="device.MCXA266.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.examples_aead.condition_id">
      <require condition="allOf.component.sgi_pkc.aead, component.sgi_pkc.aead_modes, component.sgi_pkc.flow_protection, component.sgi_pkc.memory, component.sgi_pkc.session, device=MCXA266.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.aead, component.sgi_pkc.aead_modes, component.sgi_pkc.flow_protection, component.sgi_pkc.memory, component.sgi_pkc.session, device=MCXA266.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_aead"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_aead_modes"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_flow_protection"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_memory"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_session"/>
      <require condition="device.MCXA266.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.examples_cipher_modes.condition_id">
      <require condition="allOf.component.sgi_pkc.cipher, component.sgi_pkc.cipher_modes, component.sgi_pkc.examples_flow_protection, component.sgi_pkc.flow_protection, component.sgi_pkc.memory, component.sgi_pkc.random_modes, component.sgi_pkc.session, component.sgi_pkc.sgi, device=MCXA266.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.cipher, component.sgi_pkc.cipher_modes, component.sgi_pkc.examples_flow_protection, component.sgi_pkc.flow_protection, component.sgi_pkc.memory, component.sgi_pkc.random_modes, component.sgi_pkc.session, component.sgi_pkc.sgi, device=MCXA266.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_cipher"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_cipher_modes"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_flow_protection"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_flow_protection"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_memory"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_random_modes"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_session"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_sgi"/>
      <require condition="device.MCXA266.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.examples_crc.condition_id">
      <require condition="allOf.component.sgi_pkc.flow_protection, component.sgi_pkc.memory, component.sgi_pkc.session, device=MCXA266.internal_condition"/>
    </condition>
