vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA266_DFP.pdsc
    <condition id="allOf.component.sgi_pkc.flow_protection, component.sgi_pkc.pre_processor, component.sgi_pkc.secure_counter, device=MCXA266.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_flow_protection"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_pre_processor"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_secure_counter"/>
      <require condition="device.MCXA266.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.pkc.condition_id">
      <require condition="allOf.device=MCXA266.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.platform.mcxa.condition_id">
      <require condition="allOf.anyOf=device_id=MCXA266, component.sgi_pkc.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=device_id=MCXA266, component.sgi_pkc.internal_condition">
      <require condition="anyOf.device_id=MCXA266.internal_condition"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_main"/>
    </condition>
    <condition id="component.sgi_pkc.pre_processor.condition_id">
      <require condition="allOf.device=MCXA266.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.prng.condition_id">
      <require condition="allOf.component.sgi_pkc.flow_protection, component.sgi_pkc.pre_processor, component.sgi_pkc.random, component.sgi_pkc.secure_counter, device=MCXA266.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.flow_protection, component.sgi_pkc.pre_processor, component.sgi_pkc.random, component.sgi_pkc.secure_counter, device=MCXA266.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_flow_protection"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_pre_processor"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_random"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_secure_counter"/>
      <require condition="device.MCXA266.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.random.condition_id">
      <require condition="allOf.component.sgi_pkc.buffer, component.sgi_pkc.flow_protection, component.sgi_pkc.memory, component.sgi_pkc.pre_processor, component.sgi_pkc.secure_counter, device=MCXA266.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.random_modes.condition_id">
      <require condition="allOf.component.sgi_pkc.crc, component.sgi_pkc.random, device=MCXA266.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.crc, component.sgi_pkc.random, device=MCXA266.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_crc"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_random"/>
      <require condition="device.MCXA266.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.resource.condition_id">
      <require condition="allOf.component.sgi_pkc.buffer, component.sgi_pkc.dma, device=MCXA266.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.buffer, component.sgi_pkc.dma, device=MCXA266.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_buffer"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_dma"/>
      <require condition="device.MCXA266.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.rsa.condition_id">
      <require condition="allOf.component.sgi_pkc.flow_protection, component.sgi_pkc.hash, component.sgi_pkc.signature, device=MCXA266.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.flow_protection, component.sgi_pkc.hash, component.sgi_pkc.signature, device=MCXA266.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_flow_protection"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_hash"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_signature"/>
      <require condition="device.MCXA266.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.secure_counter.condition_id">
      <require condition="allOf.component.sgi_pkc.flow_protection, component.sgi_pkc.pre_processor, device=MCXA266.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.flow_protection, component.sgi_pkc.pre_processor, device=MCXA266.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_flow_protection"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_pre_processor"/>
      <require condition="device.MCXA266.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.session.condition_id">
      <require condition="allOf.component.sgi_pkc.crc, component.sgi_pkc.flow_protection, component.sgi_pkc.random, component.sgi_pkc.resource, device=MCXA266.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.crc, component.sgi_pkc.flow_protection, component.sgi_pkc.random, component.sgi_pkc.resource, device=MCXA266.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_crc"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_flow_protection"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_random"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_resource"/>
      <require condition="device.MCXA266.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.sgi.condition_id">
      <require condition="allOf.component.sgi_pkc.aead, component.sgi_pkc.aead_modes, component.sgi_pkc.aes, component.sgi_pkc.cipher, component.sgi_pkc.cipher_modes, component.sgi_pkc.flow_protection, component.sgi_pkc.hash, component.sgi_pkc.hashmodes, component.sgi_pkc.hmac, component.sgi_pkc.key, component.sgi_pkc.mac, component.sgi_pkc.mac_modes, component.sgi_pkc.memory, component.sgi_pkc.pre_processor, component.sgi_pkc.secure_counter, component.sgi_pkc.toolchain, component.sgi_pkc.trng, device=MCXA266.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.aead, component.sgi_pkc.aead_modes, component.sgi_pkc.aes, component.sgi_pkc.cipher, component.sgi_pkc.cipher_modes, component.sgi_pkc.flow_protection, component.sgi_pkc.hash, component.sgi_pkc.hashmodes, component.sgi_pkc.hmac, component.sgi_pkc.key, component.sgi_pkc.mac, component.sgi_pkc.mac_modes, component.sgi_pkc.memory, component.sgi_pkc.pre_processor, component.sgi_pkc.secure_counter, component.sgi_pkc.toolchain, component.sgi_pkc.trng, device=MCXA266.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_aead"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_aead_modes"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_aes"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_cipher"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_cipher_modes"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_flow_protection"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_hash"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_hashmodes"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_hmac"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_key"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_mac"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_mac_modes"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_memory"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_pre_processor"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_secure_counter"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_toolchain"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_trng"/>
      <require condition="device.MCXA266.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.sgi_pkc.condition_id">
      <require condition="allOf.device=MCXA266.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.signature.condition_id">
      <require condition="allOf.component.sgi_pkc.flow_protection, component.sgi_pkc.pre_processor, component.sgi_pkc.secure_counter, component.sgi_pkc.toolchain, device=MCXA266.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.flow_protection, component.sgi_pkc.pre_processor, component.sgi_pkc.secure_counter, component.sgi_pkc.toolchain, device=MCXA266.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_flow_protection"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_pre_processor"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_secure_counter"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_toolchain"/>
      <require condition="device.MCXA266.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.static_lib.mcxa.condition_id">
      <require condition="allOf.anyOf=device_id=MCXA266.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.toolchain.condition_id">
      <require condition="allOf.device=MCXA266.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.trng.condition_id">
      <require condition="allOf.component.sgi_pkc.flow_protection, component.sgi_pkc.memory, component.sgi_pkc.pre_processor, component.sgi_pkc.secure_counter, driver.trng, device=MCXA266.internal_condition"/>
    </condition>
