vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA266_DFP.pdsc
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_data_integrity" Cversion="1.0.0" condition="component.sgi_pkc.data_integrity.condition_id">
      <description>Component sgi_pkc data_integrity</description>
      <files>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslDataIntegrity/inc/mcuxCsslDataIntegrity.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslDataIntegrity/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslDataIntegrity/inc/mcuxCsslDataIntegrity_AssemblyMacros.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslDataIntegrity/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslDataIntegrity/inc/mcuxCsslDataIntegrity_Cfg.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslDataIntegrity/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslDataIntegrity/inc/mcuxCsslDataIntegrity_Impl.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslDataIntegrity/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslDataIntegrity/inc/mcuxCsslDataIntegrity_None.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslDataIntegrity/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslDataIntegrity/inc/mcuxCsslDataIntegrity_SecureCounter.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslDataIntegrity/inc"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxCsslDataIntegrity/inc/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_dma" Cversion="1.0.0" condition="component.sgi_pkc.dma.condition_id">
      <description>Component dma</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClDma/src/mcuxClDma_Drv.c" projectpath="component/sgi_pkc/src/comps/mcuxClDma/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClDma/src/mcuxClDma_Resource.c" projectpath="component/sgi_pkc/src/comps/mcuxClDma/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClDma/src/mcuxClDma_Utils.c" projectpath="component/sgi_pkc/src/comps/mcuxClDma/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClDma/src/mcuxClDma_Utils_Sgi.c" projectpath="component/sgi_pkc/src/comps/mcuxClDma/src"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClDma/inc/mcuxClDma_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClDma/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClDma/inc/internal/mcuxClDma_Drv.h" projectpath="component/sgi_pkc/src/comps/mcuxClDma/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClDma/inc/internal/mcuxClDma_FeatureConfig.h" projectpath="component/sgi_pkc/src/comps/mcuxClDma/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClDma/inc/internal/mcuxClDma_Resource.h" projectpath="component/sgi_pkc/src/comps/mcuxClDma/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClDma/inc/internal/mcuxClDma_Sfr.h" projectpath="component/sgi_pkc/src/comps/mcuxClDma/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClDma/inc/internal/mcuxClDma_SfrAccess.h" projectpath="component/sgi_pkc/src/comps/mcuxClDma/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClDma/inc/internal/mcuxClDma_Utils.h" projectpath="component/sgi_pkc/src/comps/mcuxClDma/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClDma/inc/internal/mcuxClDma_Utils_Sgi.h" projectpath="component/sgi_pkc/src/comps/mcuxClDma/inc/internal"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClDma/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClDma/inc/internal/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_doc.mcxa" Cversion="1.0.0" condition="component.sgi_pkc.doc.mcxa.condition_id">
      <description>Component sgi_pkc.doc.mcxa</description>
      <files>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00287_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00290_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00296.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00296_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00299.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00299_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00302.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/a00302.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00302_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00305.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/a00305.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00305_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00308.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/a00308.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00308_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00311.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/a00311.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00311_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00314.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00314_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00317_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00320.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/a00320.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00320_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00323.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/a00323.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00323_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00326.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/a00326.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00326_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00329.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/a00329.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00329_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00332.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/a00332.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00332_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00335.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/a00335.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00335_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00338.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00338_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00341.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/a00341.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00341_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00344.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00344_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00347.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00347_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00350.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/a00350.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00350_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00353.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/a00353.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00353_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00356.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/a00356.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00356_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00359.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/a00359.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00359_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00362_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00365.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00365_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00368.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/a00368.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00368_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00371_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00374_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00377.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/a00377.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00377_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00380.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/a00380.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00380_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00383.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00383_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00386.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/a00386.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00386_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00389.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/a00389.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00389_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00392.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/a00392.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00392_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00395.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/a00395.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00395_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00398.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/a00398.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00398_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00401_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00404_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00407_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00410.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00410_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00413.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00413_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00416.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/a00416.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00416_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00419.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/a00419.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00419_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00422.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/a00422.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00422_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00425.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/a00425.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00425_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00428.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00428_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00431.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00431_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00434.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/a00434.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00434_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00437.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/a00437.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00437_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00440.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/a00440.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00440_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00443.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/a00443.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00443_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00446.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/a00446.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00446_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00449.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00449_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00452.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00452_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00455.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/a00455.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00455_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00458.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/a00458.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00458_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00461.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00461_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00464.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/a00464.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00464_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00467.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00467_source.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/a00470.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/a00470.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
