vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA266_DFP.pdsc
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/examples.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/files.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/files_dup.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/folderclosed.svg" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/folderclosedd.svg" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/folderopen.svg" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/folderopend.svg" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/functions.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/functions_vars.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/globals.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/globals_defs.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/globals_defs.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/globals_dup.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/globals_func.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/globals_type.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/globals_vars.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/globals_vars.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/index.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/index.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/jquery.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/modules.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/modules.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="image" name="components/sgi_pkc/doc/mcxa/html/nav_f.png" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="image" name="components/sgi_pkc/doc/mcxa/html/nav_fd.png" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="image" name="components/sgi_pkc/doc/mcxa/html/nav_g.png" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="image" name="components/sgi_pkc/doc/mcxa/html/nav_h.png" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="image" name="components/sgi_pkc/doc/mcxa/html/nav_hd.png" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/navtree.css" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/navtree.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/navtreedata.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/navtreeindex0.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/navtreeindex1.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/navtreeindex2.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/navtreeindex3.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/navtreeindex4.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/navtreeindex5.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/navtreeindex6.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/navtreeindex7.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/navtreeindex8.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="image" name="components/sgi_pkc/doc/mcxa/html/open.png" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/pages.html" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/resize.js" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="image" name="components/sgi_pkc/doc/mcxa/html/splitbar.png" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="image" name="components/sgi_pkc/doc/mcxa/html/splitbard.png" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="image" name="components/sgi_pkc/doc/mcxa/html/sync_off.png" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="image" name="components/sgi_pkc/doc/mcxa/html/sync_on.png" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="image" name="components/sgi_pkc/doc/mcxa/html/tab_a.png" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="image" name="components/sgi_pkc/doc/mcxa/html/tab_ad.png" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="image" name="components/sgi_pkc/doc/mcxa/html/tab_b.png" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="image" name="components/sgi_pkc/doc/mcxa/html/tab_bd.png" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="image" name="components/sgi_pkc/doc/mcxa/html/tab_h.png" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="image" name="components/sgi_pkc/doc/mcxa/html/tab_hd.png" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="image" name="components/sgi_pkc/doc/mcxa/html/tab_s.png" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="image" name="components/sgi_pkc/doc/mcxa/html/tab_sd.png" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/tabs.css" projectpath="component/sgi_pkc/doc/mcxa/html"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/all_0.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/all_1.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/all_2.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/all_3.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/all_4.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/all_5.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/all_6.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/all_7.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/all_8.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/all_9.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/all_a.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/all_b.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/all_c.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/all_d.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/all_e.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/all_f.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/classes_0.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/close.svg" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/defines_0.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/files_0.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/functions_0.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/groups_0.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/groups_1.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/groups_2.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/groups_3.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/groups_4.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/groups_5.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/groups_6.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/groups_7.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/groups_8.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/groups_9.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/groups_a.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/groups_b.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/mag.svg" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/mag_d.svg" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/mag_sel.svg" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/mag_seld.svg" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/pages_0.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/pages_1.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="doc" name="components/sgi_pkc/doc/mcxa/html/search/search.css" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/search.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/searchdata.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/typedefs_0.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/variables_0.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/variables_1.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/variables_2.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/variables_3.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/variables_4.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/variables_5.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/variables_6.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/variables_7.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/variables_8.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/variables_9.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/variables_a.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/variables_b.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="other" name="components/sgi_pkc/doc/mcxa/html/search/variables_c.js" projectpath="component/sgi_pkc/doc/mcxa/html/search"/>
        <file category="doc" name="components/sgi_pkc/LICENSE.txt" projectpath="component/sgi_pkc"/>
        <file category="other" name="components/sgi_pkc/SBOM-MCU_DCI-DCI_SDK_V1.0.0.spdx.json" projectpath="component/sgi_pkc"/>
        <file category="doc" name="components/sgi_pkc/ReleaseNotes.txt" projectpath="component/sgi_pkc"/>
        <file category="include" name="components/sgi_pkc/"/>
      </files>
    </component>
