vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA266_DFP.pdsc
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_padding" Cversion="1.0.0" condition="component.sgi_pkc.padding.condition_id">
      <description>Component sgi_pkc.padding</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClPadding/src/mcuxClPadding.c" projectpath="component/sgi_pkc/src/comps/mcuxClPadding/src"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClPadding/inc/mcuxClPadding.h" projectpath="component/sgi_pkc/src/comps/mcuxClPadding/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClPadding/inc/mcuxClPadding_Constants.h" projectpath="component/sgi_pkc/src/comps/mcuxClPadding/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClPadding/inc/mcuxClPadding_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClPadding/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClPadding/inc/internal/mcuxClPadding_Functions_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClPadding/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClPadding/inc/internal/mcuxClPadding_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClPadding/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClPadding/inc/internal/mcuxClPadding_Types_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClPadding/inc/internal"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClPadding/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClPadding/inc/internal/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_param_integrity" Cversion="1.0.0" condition="component.sgi_pkc.param_integrity.condition_id">
      <description>Component sgi_pkc param_integrity</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxCsslParamIntegrity/src/mcuxCsslParamIntegrity32.c" projectpath="component/sgi_pkc/src/comps/mcuxCsslParamIntegrity/src"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslParamIntegrity/inc/mcuxCsslParamIntegrity.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslParamIntegrity/inc"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxCsslParamIntegrity/inc/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_pkc" Cversion="1.0.0" condition="component.sgi_pkc.pkc.condition_id">
      <description>Component pkc</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClPkc/src/mcuxClPkc_Calculate.c" projectpath="component/sgi_pkc/src/comps/mcuxClPkc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClPkc/src/mcuxClPkc_ImportExport.c" projectpath="component/sgi_pkc/src/comps/mcuxClPkc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClPkc/src/mcuxClPkc_Initialize.c" projectpath="component/sgi_pkc/src/comps/mcuxClPkc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClPkc/src/mcuxClPkc_UPTRT.c" projectpath="component/sgi_pkc/src/comps/mcuxClPkc/src"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClPkc/inc/internal/mcuxClPkc_BasicDefs.h" projectpath="component/sgi_pkc/src/comps/mcuxClPkc/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClPkc/inc/internal/mcuxClPkc_FupMacros.h" projectpath="component/sgi_pkc/src/comps/mcuxClPkc/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClPkc/inc/internal/mcuxClPkc_ImportExport.h" projectpath="component/sgi_pkc/src/comps/mcuxClPkc/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClPkc/inc/internal/mcuxClPkc_Inline_Functions.h" projectpath="component/sgi_pkc/src/comps/mcuxClPkc/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClPkc/inc/internal/mcuxClPkc_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClPkc/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClPkc/inc/internal/mcuxClPkc_Internal_Functions.h" projectpath="component/sgi_pkc/src/comps/mcuxClPkc/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClPkc/inc/internal/mcuxClPkc_Internal_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClPkc/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClPkc/inc/internal/mcuxClPkc_Macros.h" projectpath="component/sgi_pkc/src/comps/mcuxClPkc/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClPkc/inc/internal/mcuxClPkc_Operations.h" projectpath="component/sgi_pkc/src/comps/mcuxClPkc/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClPkc/inc/internal/mcuxClPkc_Resource.h" projectpath="component/sgi_pkc/src/comps/mcuxClPkc/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClPkc/inc/internal/mcuxClPkc_SfrAccess.h" projectpath="component/sgi_pkc/src/comps/mcuxClPkc/inc/internal"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClPkc/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClPkc/inc/internal/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_platform_mcxa" Cversion="1.0.0" condition="component.sgi_pkc.platform.mcxa.condition_id">
      <description>Component sgi_pkc platform.mcxa</description>
      <files>
        <file category="header" name="components/sgi_pkc/src/platforms/mcxa/platform_specific_headers.h" projectpath="component/sgi_pkc/src/platforms/mcxa"/>
        <file category="header" name="components/sgi_pkc/src/platforms/mcxa/mcuxClConfig.h" projectpath="component/sgi_pkc/src/platforms/mcxa"/>
        <file category="header" name="components/sgi_pkc/src/platforms/mcxa/inc/ip_platform.h" projectpath="component/sgi_pkc/src/platforms/mcxa/inc"/>
        <file category="header" name="components/sgi_pkc/includes/platform/mcxa/mcuxClAeadModes_MemoryConsumption.h" projectpath="component/sgi_pkc/includes/platform/mcxa"/>
        <file category="header" name="components/sgi_pkc/includes/platform/mcxa/mcuxClCipherModes_MemoryConsumption.h" projectpath="component/sgi_pkc/includes/platform/mcxa"/>
        <file category="header" name="components/sgi_pkc/includes/platform/mcxa/mcuxClEcc_MemoryConsumption.h" projectpath="component/sgi_pkc/includes/platform/mcxa"/>
        <file category="header" name="components/sgi_pkc/includes/platform/mcxa/mcuxClFfdh_MemoryConsumption.h" projectpath="component/sgi_pkc/includes/platform/mcxa"/>
        <file category="header" name="components/sgi_pkc/includes/platform/mcxa/mcuxClHash_MemoryConsumption.h" projectpath="component/sgi_pkc/includes/platform/mcxa"/>
        <file category="header" name="components/sgi_pkc/includes/platform/mcxa/mcuxClHashModes_MemoryConsumption.h" projectpath="component/sgi_pkc/includes/platform/mcxa"/>
        <file category="header" name="components/sgi_pkc/includes/platform/mcxa/mcuxClHmac_MemoryConsumption.h" projectpath="component/sgi_pkc/includes/platform/mcxa"/>
        <file category="header" name="components/sgi_pkc/includes/platform/mcxa/mcuxClKey_MemoryConsumption.h" projectpath="component/sgi_pkc/includes/platform/mcxa"/>
        <file category="header" name="components/sgi_pkc/includes/platform/mcxa/mcuxClMacModes_MemoryConsumption.h" projectpath="component/sgi_pkc/includes/platform/mcxa"/>
        <file category="header" name="components/sgi_pkc/includes/platform/mcxa/mcuxClRandomModes_MemoryConsumption.h" projectpath="component/sgi_pkc/includes/platform/mcxa"/>
        <file category="header" name="components/sgi_pkc/includes/platform/mcxa/mcuxClResource_MemoryConsumption.h" projectpath="component/sgi_pkc/includes/platform/mcxa"/>
        <file category="header" name="components/sgi_pkc/includes/platform/mcxa/mcuxClRsa_MemoryConsumption.h" projectpath="component/sgi_pkc/includes/platform/mcxa"/>
        <file category="header" name="components/sgi_pkc/includes/platform/mcxa/mcuxClSession_Internal_AssemblyHeader.h" projectpath="component/sgi_pkc/includes/platform/mcxa"/>
        <file category="header" name="components/sgi_pkc/includes/platform/mcxa/mcuxClSession_MemoryConsumption.h" projectpath="component/sgi_pkc/includes/platform/mcxa"/>
        <file category="header" name="components/sgi_pkc/includes/platform/mcxa/mcuxClSignature_MemoryConsumption.h" projectpath="component/sgi_pkc/includes/platform/mcxa"/>
        <file category="header" name="components/sgi_pkc/includes/platform/mcxa/mcuxCsslMemory_AssemblyHeader.h" projectpath="component/sgi_pkc/includes/platform/mcxa"/>
        <file category="header" name="components/sgi_pkc/includes/platform/mcxa/mcuxCsslPrng_AssemblyHeader.h" projectpath="component/sgi_pkc/includes/platform/mcxa"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/platforms/mcxa/"/>
        <file category="include" name="components/sgi_pkc/src/platforms/mcxa/inc/"/>
        <file category="include" name="components/sgi_pkc/includes/platform/mcxa/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_pre_processor" Cversion="1.0.0" condition="component.sgi_pkc.pre_processor.condition_id">
      <description>Component sgi_pkc pre_processor</description>
      <files>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslCPreProcessor/inc/mcuxCsslAnalysis.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslCPreProcessor/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslCPreProcessor/inc/mcuxCsslAssembly.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslCPreProcessor/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslCPreProcessor/inc/mcuxCsslCPreProcessor.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslCPreProcessor/inc"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxCsslCPreProcessor/inc/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_prng" Cversion="1.0.0" condition="component.sgi_pkc.prng.condition_id">
      <description>Component sgi_pkc prng</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClPrng/src/mcuxClPrng.c" projectpath="component/sgi_pkc/src/comps/mcuxClPrng/src"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClPrng/inc/internal/mcuxClPrng_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClPrng/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClPrng/inc/internal/mcuxClPrng_Internal_Constants.h" projectpath="component/sgi_pkc/src/comps/mcuxClPrng/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClPrng/inc/internal/mcuxClPrng_Internal_Functions.h" projectpath="component/sgi_pkc/src/comps/mcuxClPrng/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClPrng/inc/internal/mcuxClPrng_Internal_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClPrng/inc/internal"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxCsslPrng/src/size/size.c" projectpath="component/sgi_pkc/src/comps/mcuxCsslPrng/src/size"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslPrng/inc/internal/mcuxCsslPrng_AssemblyMacros.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslPrng/inc/internal" path="components/sgi_pkc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslPrng/inc/internal/mcuxCsslPrng_Macros.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslPrng/inc/internal" path="components/sgi_pkc"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClPrng/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClPrng/inc/internal/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxCsslPrng/inc/"/>
      </files>
    </component>
