vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA266_DFP.pdsc
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_session" Cversion="1.0.0" condition="component.sgi_pkc.session.condition_id">
      <description>Component sgi_pkc.session</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClSession/src/mcuxClSession.c" projectpath="component/sgi_pkc/src/comps/mcuxClSession/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClSession/src/mcuxClSession_jobHandling.c" projectpath="component/sgi_pkc/src/comps/mcuxClSession/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClSession/src/size/size.c" projectpath="component/sgi_pkc/src/comps/mcuxClSession/src/size"/>
        <file category="sourceAsm" name="components/sgi_pkc/src/comps/mcuxClSession/src/asm/mcuxClSession_Internal_EntryExit_EarlyExit_Entry_arm.S" projectpath="component/sgi_pkc/src/comps/mcuxClSession/src/asm"/>
        <file category="sourceAsm" name="components/sgi_pkc/src/comps/mcuxClSession/src/asm/mcuxClSession_Internal_EntryExit_EarlyExit_Return_arm.S" projectpath="component/sgi_pkc/src/comps/mcuxClSession/src/asm"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSession/inc/mcuxClSession.h" projectpath="component/sgi_pkc/src/comps/mcuxClSession/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSession/inc/mcuxClSession_Functions.h" projectpath="component/sgi_pkc/src/comps/mcuxClSession/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSession/inc/mcuxClSession_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClSession/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSession/inc/internal/mcuxClSession_FeatureConfig.h" projectpath="component/sgi_pkc/src/comps/mcuxClSession/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSession/inc/internal/mcuxClSession_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClSession/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSession/inc/internal/mcuxClSession_Internal_EntryExit.h" projectpath="component/sgi_pkc/src/comps/mcuxClSession/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSession/inc/internal/mcuxClSession_Internal_EntryExit_EarlyExit.h" projectpath="component/sgi_pkc/src/comps/mcuxClSession/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSession/inc/internal/mcuxClSession_Internal_EntryExit_EarlyExit_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClSession/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSession/inc/internal/mcuxClSession_Internal_Functions.h" projectpath="component/sgi_pkc/src/comps/mcuxClSession/inc/internal"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClSession/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClSession/inc/internal/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_sgi" Cversion="1.0.0" condition="component.sgi_pkc.sgi.condition_id">
      <description>Component sgi_pkc.sgi</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClSgi/src/mcuxClSgi_Drv.c" projectpath="component/sgi_pkc/src/comps/mcuxClSgi/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClSgi/src/mcuxClSgi_Utils.c" projectpath="component/sgi_pkc/src/comps/mcuxClSgi/src"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSgi/inc/mcuxClSgi_Constants.h" projectpath="component/sgi_pkc/src/comps/mcuxClSgi/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSgi/inc/mcuxClSgi_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClSgi/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSgi/inc/internal/mcuxClSgi_Drv.h" projectpath="component/sgi_pkc/src/comps/mcuxClSgi/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSgi/inc/internal/mcuxClSgi_Internal_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClSgi/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSgi/inc/internal/mcuxClSgi_Sfr_Ctrl.h" projectpath="component/sgi_pkc/src/comps/mcuxClSgi/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSgi/inc/internal/mcuxClSgi_Sfr_RegBank.h" projectpath="component/sgi_pkc/src/comps/mcuxClSgi/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSgi/inc/internal/mcuxClSgi_Sfr_Sec.h" projectpath="component/sgi_pkc/src/comps/mcuxClSgi/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSgi/inc/internal/mcuxClSgi_Sfr_Status.h" projectpath="component/sgi_pkc/src/comps/mcuxClSgi/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSgi/inc/internal/mcuxClSgi_SfrAccess.h" projectpath="component/sgi_pkc/src/comps/mcuxClSgi/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSgi/inc/internal/mcuxClSgi_Utils.h" projectpath="component/sgi_pkc/src/comps/mcuxClSgi/inc/internal"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClSgi/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClSgi/inc/internal/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_sgi_pkc" Cversion="1.0.0" condition="component.sgi_pkc.sgi_pkc.condition_id">
      <description>Component sgi_pkc</description>
      <files>
        <file category="doc" name="components/sgi_pkc/component.sgi_pkc.sgi_pkc_dummy.txt"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_signature" Cversion="1.0.0" condition="component.sgi_pkc.signature.condition_id">
      <description>Component sgi_pkc.signature</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClSignature/src/mcuxClSignature.c" projectpath="component/sgi_pkc/src/comps/mcuxClSignature/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClSignature/src/size/size.c" projectpath="component/sgi_pkc/src/comps/mcuxClSignature/src/size"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSignature/inc/mcuxClSignature.h" projectpath="component/sgi_pkc/src/comps/mcuxClSignature/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSignature/inc/mcuxClSignature_Constants.h" projectpath="component/sgi_pkc/src/comps/mcuxClSignature/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSignature/inc/mcuxClSignature_Functions.h" projectpath="component/sgi_pkc/src/comps/mcuxClSignature/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSignature/inc/mcuxClSignature_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClSignature/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSignature/inc/internal/mcuxClSignature_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClSignature/inc/internal"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClSignature/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClSignature/inc/internal/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_static_lib_mcxa" Cversion="1.0.0" condition="component.sgi_pkc.static_lib.mcxa.condition_id">
      <description>Component sgi_pkc.static_lib.mcxa</description>
      <files>
        <file category="library" name="components/sgi_pkc/static_library/mcxa/libclns.a" projectpath="component/sgi_pkc/static_library/mcxa"/>
        <file category="other" name="components/sgi_pkc/static_library/mcxa/libclns.a.libsize" projectpath="component/sgi_pkc/static_library/mcxa"/>
        <file category="other" name="components/sgi_pkc/static_library/mcxa/libclns.a.objsize" projectpath="component/sgi_pkc/static_library/mcxa"/>
        <file category="include" name="components/sgi_pkc/"/>
      </files>
    </component>
