vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA266_DFP.pdsc
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_toolchain" Cversion="1.0.0" condition="component.sgi_pkc.toolchain.condition_id">
      <description>Component sgi_pkc toolchain</description>
      <files>
        <file category="header" name="components/sgi_pkc/src/compiler/mcuxClToolchain.h" projectpath="component/sgi_pkc/src/compiler"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/compiler/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_trng" Cversion="1.0.0" condition="component.sgi_pkc.trng.condition_id">
      <description>Component sgi_pkc.trng</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClTrng/src/mcuxClTrng_SA_TRNG.c" projectpath="component/sgi_pkc/src/comps/mcuxClTrng/src"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClTrng/inc/internal/mcuxClTrng_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClTrng/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClTrng/inc/internal/mcuxClTrng_Internal_Constants.h" projectpath="component/sgi_pkc/src/comps/mcuxClTrng/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClTrng/inc/internal/mcuxClTrng_Internal_Functions.h" projectpath="component/sgi_pkc/src/comps/mcuxClTrng/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClTrng/inc/internal/mcuxClTrng_Internal_SA_TRNG.h" projectpath="component/sgi_pkc/src/comps/mcuxClTrng/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClTrng/inc/internal/mcuxClTrng_Internal_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClTrng/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClTrng/inc/internal/mcuxClTrng_SfrAccess.h" projectpath="component/sgi_pkc/src/comps/mcuxClTrng/inc/internal"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClTrng/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClTrng/inc/internal/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager" Cversion="1.0.0" condition="component.timer_manager.condition_id">
      <description>Component timer_manager</description>
      <files>
        <file category="header" name="components/timer_manager/fsl_component_timer_manager.h" projectpath="component/timer_manager"/>
        <file category="sourceC" name="components/timer_manager/fsl_component_timer_manager.c" projectpath="component/timer_manager"/>
        <file category="include" name="components/timer_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MCXA266_header" Cversion="1.0.0" condition="device.CMSIS.condition_id">
      <description>Device MCXA266_cmsis</description>
      <files>
        <file category="header" name="devices/MCXA266/fsl_device_registers.h" projectpath="device"/>
        <file category="header" name="devices/MCXA266/MCXA266.h" projectpath="device"/>
        <file category="header" name="devices/MCXA266/MCXA266_features.h" projectpath="device"/>
        <file category="header" name="devices/MCXA266/MCXA266_COMMON.h" projectpath="device"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_ADC.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_AOI.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_CAN.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_CDOG.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_CMC.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_CRC.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_CTIMER.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_DEBUGMAILBOX.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_DIGTMP.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_DMA.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_EIM.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_EQDC.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_ERM.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_FLEXIO.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_FMC.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_FMU.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_FREQME.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_GLIKEY.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_GPIO.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_I3C.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_INPUTMUX.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_LCD.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_LPCMP.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_LPDAC.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_LPI2C.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_LPSPI.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_LPTMR.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_LPUART.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_MRCC.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_OPAMP.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_OSTIMER.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_PKC.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_PORT.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_PWM.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_RTC.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_SCG.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_SGI.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_SMARTDMA.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_SPC.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_SYSCON.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_TRDC.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_TRNG.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_UDF.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_USB.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_UTICK.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_VBAT.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_WAKETIMER.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_WUU.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXA266/periph5/PERI_WWDT.h" projectpath="device/periph5"/>
        <file category="include" name="devices/MCXA266/"/>
        <file category="include" name="devices/MCXA266/periph5/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.RTE.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="header" attr="config" name="devices/MCXA266/template/RTE_Device.h" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MCXA266/template/"/>
      </files>
    </component>
